In [1]:
import numpy as np
import pandas as pd
import io

In [2]:
data=pd.read_csv("p1.csv")

In [3]:
data

   Unnamed: 0 Unnamed: 1     Unnamed: 2   Unnamed: 3  Unnamed: 4
0       Si_no       Name  Qualification      Address       MobNo
1           1    Deepthi        Manager       Tumkur  8296289864
2           2     Darshu          Clerk     Madikeri  6364651270
3           3     Nethra             HR  Dharmastala  9663782026
4           4   Prasanna            HOD       Hnpura  9449129979
5           5      Punya            NaN        Ujire  8762874755
6           6     Tharun        Lecture       Puttur  9008284434
7           7      Nanda           Dean    Mangalore  7008267811
8           8      Ambhi      Principal    Bangalore  9082657393
9           9      Suchi      Head Miss       Mysore         NaN
10         10    Koushik            HOD       Hassan         NaN

In [4]:
data.head(3)

  Unnamed: 0 Unnamed: 1     Unnamed: 2 Unnamed: 3  Unnamed: 4
0      Si_no       Name  Qualification    Address       MobNo
1          1    Deepthi        Manager     Tumkur  8296289864
2          2     Darshu          Clerk   Madikeri  6364651270

In [5]:
data.tail(3)

   Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3  Unnamed: 4
8           8      Ambhi  Principal  Bangalore  9082657393
9           9      Suchi  Head Miss     Mysore         NaN
10         10    Koushik        HOD     Hassan         NaN

In [6]:
data.isnull().sum()

Unnamed: 0    0
Unnamed: 1    0
Unnamed: 2    1
Unnamed: 3    0
Unnamed: 4    2
dtype: int64

In [10]:
data.drop_duplicates(subset=["Name"],keep="last",inplace=True)

KeyError: Index(['Name'], dtype='object')

In [11]:
data=pd.read_csv("p1.csv")

In [12]:
data

   Si_no      Name Qualification      Address         MobNo
0      1   Deepthi       Manager       Tumkur  8.296290e+09
1      2    Darshu         Clerk     Madikeri  6.364651e+09
2      3    Nethra            HR  Dharmastala  9.663782e+09
3      4  Prasanna           HOD       Hnpura  9.449130e+09
4      5     Punya           NaN        Ujire  8.762875e+09
5      6    Tharun       Lecture       Puttur  9.008284e+09
6      7     Nanda          Dean    Mangalore  7.008268e+09
7      8     Ambhi     Principal    Bangalore  9.082657e+09
8      9     Suchi     Head Miss       Mysore           NaN
9     10   Koushik           HOD       Hassan           NaN

In [13]:
data.drop_duplicates(subset=["Name"],keep="last",inplace=True)

In [14]:
data

   Si_no      Name Qualification      Address         MobNo
0      1   Deepthi       Manager       Tumkur  8.296290e+09
1      2    Darshu         Clerk     Madikeri  6.364651e+09
2      3    Nethra            HR  Dharmastala  9.663782e+09
3      4  Prasanna           HOD       Hnpura  9.449130e+09
4      5     Punya           NaN        Ujire  8.762875e+09
5      6    Tharun       Lecture       Puttur  9.008284e+09
6      7     Nanda          Dean    Mangalore  7.008268e+09
7      8     Ambhi     Principal    Bangalore  9.082657e+09
8      9     Suchi     Head Miss       Mysore           NaN
9     10   Koushik           HOD       Hassan           NaN

In [15]:
data.isnull().sum()

Si_no            0
Name             0
Qualification    1
Address          0
MobNo            2
dtype: int64

In [16]:
import pandas as pd
import numpy as np

In [17]:
array=np.array([[1,1,1],[2,3,8],[3,5,27],])

In [18]:
index_values=['Row1','Row2','Row3']

In [19]:
column_values=['Col1','Col2','Col3']

In [20]:
df=pd.DataFrame(data=array,
               index=index_values,
               columns=column_values)

In [21]:
df

      Col1  Col2  Col3
Row1     1     1     1
Row2     2     3     8
Row3     3     5    27

In [22]:
print(df)

      Col1  Col2  Col3
Row1     1     1     1
Row2     2     3     8
Row3     3     5    27

In [23]:
trace=np.trace(df)
print("Trace of the matrix",trace)

Trace of the matrix 31

In [24]:
trace=np.trace(df)

In [25]:
trace

31

In [26]:
data.head(10)

   Si_no      Name Qualification      Address         MobNo
0      1   Deepthi       Manager       Tumkur  8.296290e+09
1      2    Darshu         Clerk     Madikeri  6.364651e+09
2      3    Nethra            HR  Dharmastala  9.663782e+09
3      4  Prasanna           HOD       Hnpura  9.449130e+09
4      5     Punya           NaN        Ujire  8.762875e+09
5      6    Tharun       Lecture       Puttur  9.008284e+09
6      7     Nanda          Dean    Mangalore  7.008268e+09
7      8     Ambhi     Principal    Bangalore  9.082657e+09
8      9     Suchi     Head Miss       Mysore           NaN
9     10   Koushik           HOD       Hassan           NaN